In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=9)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(9,5), index=dates, columns=list('ABCDE'))

In [7]:
df

                   A         B         C         D         E
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  0.046832
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762
2013-01-05  0.315889  0.991070  1.026583  0.556367 -0.265546
2013-01-06  0.568311  0.652492  0.870752 -0.473765 -0.886818
2013-01-07 -0.563403  1.100053  1.352229  1.822668 -0.278472
2013-01-08  0.542040  1.213285  0.144815  0.981854  0.074090
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  1.012677

In [8]:
df2 = pd.DataFrame({
    'A':1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3]*4, dtype='int32'),
    'E': pd.Categorical(["test","train","test","train"]),
    'F': 'foo','G':''
})

In [9]:
df2

     A          B    C  D      E    F G
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
range(4)

[0, 1, 2, 3]

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

In [12]:
df.head()

                   A         B         C         D         E
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  0.046832
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762
2013-01-05  0.315889  0.991070  1.026583  0.556367 -0.265546

In [13]:
df.tail(3)

                   A         B         C         D         E
2013-01-07 -0.563403  1.100053  1.352229  1.822668 -0.278472
2013-01-08  0.542040  1.213285  0.144815  0.981854  0.074090
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  1.012677

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index([u'A', u'B', u'C', u'D', u'E'], dtype='object')

In [16]:
df.values

array([[-0.01468742, -0.46171356,  0.85962505,  1.71767068,  0.0468317 ],
       [ 0.01037446, -0.00552184,  0.39402806,  1.39913191,  0.97202458],
       [ 0.01451775, -2.07567617,  0.88057979, -1.57452113, -0.14886336],
       [ 1.8797631 , -0.58235057,  1.2203111 , -0.46282116,  0.63476242],
       [ 0.31588939,  0.99106968,  1.02658312,  0.55636718, -0.26554569],
       [ 0.5683112 ,  0.65249182,  0.87075155, -0.47376481, -0.88681806],
       [-0.56340264,  1.10005277,  1.35222916,  1.82266767, -0.2784716 ],
       [ 0.54203983,  1.21328502,  0.14481537,  0.98185356,  0.07409006],
       [-0.59286092,  0.21987511, -0.4923468 , -0.90888154,  1.01267687]])

In [17]:
df.describe()

              A         B         C         D         E
count  9.000000  9.000000  9.000000  9.000000  9.000000
mean   0.239994  0.116835  0.695175  0.339745  0.128965
std    0.741717  1.053352  0.582383  1.235347  0.631262
min   -0.592861 -2.075676 -0.492347 -1.574521 -0.886818
25%   -0.014687 -0.461714  0.394028 -0.473765 -0.265546
50%    0.014518  0.219875  0.870752  0.556367  0.046832
75%    0.542040  0.991070  1.026583  1.399132  0.634762
max    1.879763  1.213285  1.352229  1.822668  1.012677

In [18]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [19]:
df.T.sort_index(axis=1, ascending=True)

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,2013-01-07 00:00:00,2013-01-08 00:00:00,2013-01-09 00:00:00
A,-0.014687,0.010374,0.014518,1.879763,0.315889,0.568311,-0.563403,0.542040,-0.592861
B,-0.461714,-0.005522,-2.075676,-0.582351,0.991070,0.652492,1.100053,1.213285,0.219875
C,0.859625,0.394028,0.880580,1.220311,1.026583,0.870752,1.352229,0.144815,-0.492347
D,1.717671,1.399132,-1.574521,-0.462821,0.556367,-0.473765,1.822668,0.981854,-0.908882
E,0.046832,0.972025,-0.148863,0.634762,-0.265546,-0.886818,-0.278472,0.074090,1.012677

In [20]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D         E
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  0.046832
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762
2013-01-05  0.315889  0.991070  1.026583  0.556367 -0.265546
2013-01-06  0.568311  0.652492  0.870752 -0.473765 -0.886818
2013-01-07 -0.563403  1.100053  1.352229  1.822668 -0.278472
2013-01-08  0.542040  1.213285  0.144815  0.981854  0.074090
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  1.012677

In [21]:
df.sort_index(axis=1,ascending=False)

                   E         D         C         B         A
2013-01-01  0.046832  1.717671  0.859625 -0.461714 -0.014687
2013-01-02  0.972025  1.399132  0.394028 -0.005522  0.010374
2013-01-03 -0.148863 -1.574521  0.880580 -2.075676  0.014518
2013-01-04  0.634762 -0.462821  1.220311 -0.582351  1.879763
2013-01-05 -0.265546  0.556367  1.026583  0.991070  0.315889
2013-01-06 -0.886818 -0.473765  0.870752  0.652492  0.568311
2013-01-07 -0.278472  1.822668  1.352229  1.100053 -0.563403
2013-01-08  0.074090  0.981854  0.144815  1.213285  0.542040
2013-01-09  1.012677 -0.908882 -0.492347  0.219875 -0.592861

#selection

In [22]:
df['A']

2013-01-01   -0.014687
2013-01-02    0.010374
2013-01-03    0.014518
2013-01-04    1.879763
2013-01-05    0.315889
2013-01-06    0.568311
2013-01-07   -0.563403
2013-01-08    0.542040
2013-01-09   -0.592861
Freq: D, Name: A, dtype: float64

In [23]:
df['2013-01-01':'2013-01-04']

                   A         B         C         D         E
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  0.046832
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762

In [24]:
df.loc[dates[1]]

A    0.010374
B   -0.005522
C    0.394028
D    1.399132
E    0.972025
Name: 2013-01-02 00:00:00, dtype: float64

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.014687 -0.461714
2013-01-02  0.010374 -0.005522
2013-01-03  0.014518 -2.075676
2013-01-04  1.879763 -0.582351
2013-01-05  0.315889  0.991070
2013-01-06  0.568311  0.652492
2013-01-07 -0.563403  1.100053
2013-01-08  0.542040  1.213285
2013-01-09 -0.592861  0.219875

In [26]:
df.loc['2013-01-02':'2013-01-11',['A','B']]

                   A         B
2013-01-02  0.010374 -0.005522
2013-01-03  0.014518 -2.075676
2013-01-04  1.879763 -0.582351
2013-01-05  0.315889  0.991070
2013-01-06  0.568311  0.652492
2013-01-07 -0.563403  1.100053
2013-01-08  0.542040  1.213285
2013-01-09 -0.592861  0.219875

In [27]:
df.at[dates[0],'A']

-0.014687419694191415

In [28]:
df.iloc[3]

A    1.879763
B   -0.582351
C    1.220311
D   -0.462821
E    0.634762
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5,0:3]

                   A         B         C
2013-01-04  1.879763 -0.582351  1.220311
2013-01-05  0.315889  0.991070  1.026583

In [30]:
df

                   A         B         C         D         E
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  0.046832
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762
2013-01-05  0.315889  0.991070  1.026583  0.556367 -0.265546
2013-01-06  0.568311  0.652492  0.870752 -0.473765 -0.886818
2013-01-07 -0.563403  1.100053  1.352229  1.822668 -0.278472
2013-01-08  0.542040  1.213285  0.144815  0.981854  0.074090
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  1.012677

In [31]:
df.at[dates[2],'A']

0.014517753568043846

In [32]:
df[df.A>0]

                   A         B         C         D         E
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762
2013-01-05  0.315889  0.991070  1.026583  0.556367 -0.265546
2013-01-06  0.568311  0.652492  0.870752 -0.473765 -0.886818
2013-01-08  0.542040  1.213285  0.144815  0.981854  0.074090

In [33]:
df3 = df.copy()

In [34]:
df3['E'] = ['one','one','one','Two','one','Two','one','one','Two']

In [35]:
df3

                   A         B         C         D    E
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  one
2013-01-02  0.010374 -0.005522  0.394028  1.399132  one
2013-01-03  0.014518 -2.075676  0.880580 -1.574521  one
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  Two
2013-01-05  0.315889  0.991070  1.026583  0.556367  one
2013-01-06  0.568311  0.652492  0.870752 -0.473765  Two
2013-01-07 -0.563403  1.100053  1.352229  1.822668  one
2013-01-08  0.542040  1.213285  0.144815  0.981854  one
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  Two

In [36]:
df3[df3['E'].isin(['Two'])]

                   A         B         C         D    E
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  Two
2013-01-06  0.568311  0.652492  0.870752 -0.473765  Two
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  Two

In [37]:
df3['E'].isin(['Two'])

2013-01-01    False
2013-01-02    False
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06     True
2013-01-07    False
2013-01-08    False
2013-01-09     True
Freq: D, Name: E, dtype: bool

In [38]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9], index=pd.date_range('20130101',periods=9))

In [39]:
df['F']=s1

In [40]:
df

                   A         B         C         D         E  F
2013-01-01 -0.014687 -0.461714  0.859625  1.717671  0.046832  1
2013-01-02  0.010374 -0.005522  0.394028  1.399132  0.972025  2
2013-01-03  0.014518 -2.075676  0.880580 -1.574521 -0.148863  3
2013-01-04  1.879763 -0.582351  1.220311 -0.462821  0.634762  4
2013-01-05  0.315889  0.991070  1.026583  0.556367 -0.265546  5
2013-01-06  0.568311  0.652492  0.870752 -0.473765 -0.886818  6
2013-01-07 -0.563403  1.100053  1.352229  1.822668 -0.278472  7
2013-01-08  0.542040  1.213285  0.144815  0.981854  0.074090  8
2013-01-09 -0.592861  0.219875 -0.492347 -0.908882  1.012677  9

## setting values by label

In [41]:
df.at[dates[3],'F']

4

## setting values by position

In [42]:
df.iat[3,5]

4

### setting values

In [43]:
df[df > 0] = -df

In [44]:
df

                   A         B         C         D         E  F
2013-01-01 -0.014687 -0.461714 -0.859625 -1.717671 -0.046832 -1
2013-01-02 -0.010374 -0.005522 -0.394028 -1.399132 -0.972025 -2
2013-01-03 -0.014518 -2.075676 -0.880580 -1.574521 -0.148863 -3
2013-01-04 -1.879763 -0.582351 -1.220311 -0.462821 -0.634762 -4
2013-01-05 -0.315889 -0.991070 -1.026583 -0.556367 -0.265546 -5
2013-01-06 -0.568311 -0.652492 -0.870752 -0.473765 -0.886818 -6
2013-01-07 -0.563403 -1.100053 -1.352229 -1.822668 -0.278472 -7
2013-01-08 -0.542040 -1.213285 -0.144815 -0.981854 -0.074090 -8
2013-01-09 -0.592861 -0.219875 -0.492347 -0.908882 -1.012677 -9

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [46]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [47]:
df1

                   A         B         C         D         E  F         E
2013-01-01 -0.014687 -0.461714 -0.859625 -1.717671  1.000000 -1  1.000000
2013-01-02 -0.010374 -0.005522 -0.394028 -1.399132  1.000000 -2  1.000000
2013-01-03 -0.014518 -2.075676 -0.880580 -1.574521 -0.148863 -3 -0.148863
2013-01-04 -1.879763 -0.582351 -1.220311 -0.462821 -0.634762 -4 -0.634762

In [48]:
df = pd.DataFrame(np.random.randn(9,4), index=dates, columns=list('ABCD'))

In [49]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [50]:
df1

                   A         B         C         D   E
2013-01-01 -0.523062  0.178049  1.483464  0.127482 NaN
2013-01-02  0.002018 -1.729820 -0.001556 -0.235407 NaN
2013-01-03 -0.379354  0.036005  0.748226  0.632156 NaN
2013-01-04 -2.756852 -1.510008 -1.495788  0.485466 NaN

In [51]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [52]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -0.523062  0.178049  1.483464  0.127482  5.0
2013-01-02  0.002018 -1.729820 -0.001556 -0.235407  5.0
2013-01-03 -0.379354  0.036005  0.748226  0.632156  5.0
2013-01-04 -2.756852 -1.510008 -1.495788  0.485466  5.0

In [53]:
df1

                   A         B         C         D   E
2013-01-01 -0.523062  0.178049  1.483464  0.127482 NaN
2013-01-02  0.002018 -1.729820 -0.001556 -0.235407 NaN
2013-01-03 -0.379354  0.036005  0.748226  0.632156 NaN
2013-01-04 -2.756852 -1.510008 -1.495788  0.485466 NaN

In [54]:
pd.isnull(df1)

                A      B      C      D     E
2013-01-01  False  False  False  False  True
2013-01-02  False  False  False  False  True
2013-01-03  False  False  False  False  True
2013-01-04  False  False  False  False  True

In [55]:
df.mean()

A   -0.507519
B   -0.685026
C   -0.290004
D    0.740522
dtype: float64

In [56]:
df.mean(1)

2013-01-01    0.316483
2013-01-02   -0.491191
2013-01-03    0.259258
2013-01-04   -1.319295
2013-01-05   -0.459805
2013-01-06    0.411203
2013-01-07   -0.006720
2013-01-08    0.395344
2013-01-09   -0.774837
Freq: D, dtype: float64

In [57]:
df.mean(1)[:]

2013-01-01    0.316483
2013-01-02   -0.491191
2013-01-03    0.259258
2013-01-04   -1.319295
2013-01-05   -0.459805
2013-01-06    0.411203
2013-01-07   -0.006720
2013-01-08    0.395344
2013-01-09   -0.774837
Freq: D, dtype: float64

In [58]:
s = pd.Series([1,3,5,np.nan,6,8,1,2,3], index=dates).shift(2)

In [59]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
2013-01-07    6.0
2013-01-08    8.0
2013-01-09    1.0
Freq: D, dtype: float64

In [60]:
df.sub(s, axis=0)

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -1.379354 -0.963995 -0.251774 -0.367844
2013-01-04 -5.756852 -4.510008 -4.495788 -2.514534
2013-01-05 -6.730104 -6.078334 -5.447906 -3.582877
2013-01-06       NaN       NaN       NaN       NaN
2013-01-07 -5.840402 -5.411789 -8.533885 -4.240806
2013-01-08 -7.815280 -7.463448 -7.410075 -7.729823
2013-01-09 -0.943062 -3.415450 -3.418866  0.678029

In [61]:
df

                   A         B         C         D
2013-01-01 -0.523062  0.178049  1.483464  0.127482
2013-01-02  0.002018 -1.729820 -0.001556 -0.235407
2013-01-03 -0.379354  0.036005  0.748226  0.632156
2013-01-04 -2.756852 -1.510008 -1.495788  0.485466
2013-01-05 -1.730104 -1.078334 -0.447906  1.417123
2013-01-06  0.418426 -0.770441  1.466348  0.530480
2013-01-07  0.159598  0.588211 -2.533885  1.759194
2013-01-08  0.184720  0.536552  0.589925  0.270177
2013-01-09  0.056938 -2.415450 -2.418866  1.678029

In [62]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.523062  0.178049  1.483464  0.127482
2013-01-02 -0.521043 -1.551771  1.481908 -0.107925
2013-01-03 -0.900397 -1.515767  2.230135  0.524231
2013-01-04 -3.657249 -3.025775  0.734347  1.009698
2013-01-05 -5.387354 -4.104108  0.286441  2.426821
2013-01-06 -4.968928 -4.874550  1.752789  2.957301
2013-01-07 -4.809330 -4.286339 -0.781096  4.716495
2013-01-08 -4.624610 -3.749786 -0.191171  4.986672
2013-01-09 -4.567672 -6.165237 -2.610037  6.664702

In [63]:
df.apply(lambda x: x.max() - x.min())

A    3.175278
B    3.003661
C    4.017349
D    1.994601
dtype: float64

In [64]:
s = pd.Series(np.random.randint(0,7,size=10))

In [65]:
s

0    5
1    2
2    6
3    4
4    3
5    1
6    6
7    1
8    5
9    5
dtype: int32

In [66]:
s.value_counts()

5    3
6    2
1    2
4    1
3    1
2    1
dtype: int64

In [68]:
s.value_counts().sort_values()

4    1
3    1
2    1
6    2
1    2
5    3
dtype: int64

In [69]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [71]:
s.str.capitalize()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

In [72]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [80]:
df = pd.DataFrame(np.random.randint(10,100,size=10))

In [81]:
df

    0
0  96
1  81
2  61
3  67
4  25
5  72
6  50
7  69
8  76
9  45

In [87]:
df = pd.Series(np.random.randint(1,10,size=20))

In [88]:
df

0     5
1     9
2     3
3     3
4     9
5     8
6     6
7     2
8     9
9     3
10    5
11    7
12    3
13    7
14    6
15    8
16    9
17    2
18    6
19    2
dtype: int32

In [90]:
df.value_counts().sort_values()

8    2
7    2
5    2
6    3
2    3
9    4
3    4
dtype: int64

In [91]:
left = pd.DataFrame({'key':['foo','bar'],'lval':[1,2]})

In [92]:
left

   key  lval
0  foo     1
1  bar     2

In [96]:
right = pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})

In [97]:
right

   key  rval
0  foo     4
1  bar     5

In [98]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [100]:
mergedf = pd.merge(left, right, on='key')

mergedf

In [101]:
mergedf

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [102]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})

In [103]:
df

     A      B         C         D
0  foo    one  0.614078 -2.192970
1  bar    one -0.680062 -0.021221
2  foo    two  0.964288 -0.018826
3  bar  three -0.741593 -1.538054
4  foo    two -0.105064 -0.347486
5  bar    two  0.199970 -1.266036
6  foo    one -0.005818 -1.877317
7  foo  three  0.389423  0.556126

In [104]:
df.groupby('A').sum()

            C         D
A
bar -1.221685 -2.825311
foo  1.856907 -3.880474

In [109]:
df.groupby(['B','A']).sum()

                  C         D
B     A
one   bar -0.680062 -0.021221
      foo  0.608260 -4.070287
three bar -0.741593 -1.538054
      foo  0.389423  0.556126
two   bar  0.199970 -1.266036
      foo  0.859224 -0.366312

In [110]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))

In [112]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [113]:
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])

In [114]:
index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [115]:
df = pd.DataFrame(np.random.randn(8,2), index=index,columns=['A','B'])

In [117]:
df2 = df[:4]

In [118]:
df2

                     A         B
first second
bar   one    -0.507345  0.114814
      two     1.190440 -0.022191
baz   one    -1.498876  0.624801
      two     0.652455 -0.278521

In [119]:
stacked = df.stack()

In [120]:
stacked

first  second
bar    one     A   -0.507345
               B    0.114814
       two     A    1.190440
               B   -0.022191
baz    one     A   -1.498876
               B    0.624801
       two     A    0.652455
               B   -0.278521
foo    one     A    1.072411
               B    0.560429
       two     A   -0.107902
               B    1.137647
qux    one     A   -0.704393
               B    0.223720
       two     A    0.654024
               B    0.346416
dtype: float64

In [121]:
stacked.unstack()

                     A         B
first second
bar   one    -0.507345  0.114814
      two     1.190440 -0.022191
baz   one    -1.498876  0.624801
      two     0.652455 -0.278521
foo   one     1.072411  0.560429
      two    -0.107902  1.137647
qux   one    -0.704393  0.223720
      two     0.654024  0.346416

In [127]:
stacked.unstack(1)

second        one       two
first
bar   A -0.507345  1.190440
      B  0.114814 -0.022191
baz   A -1.498876  0.652455
      B  0.624801 -0.278521
foo   A  1.072411 -0.107902
      B  0.560429  1.137647
qux   A -0.704393  0.654024
      B  0.223720  0.346416

# Time Series

In [144]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [146]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [147]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [148]:
ts

2012-01-01 00:00:00    438
2012-01-01 00:00:01     59
2012-01-01 00:00:02    103
2012-01-01 00:00:03    471
2012-01-01 00:00:04    328
2012-01-01 00:00:05    409
2012-01-01 00:00:06      5
2012-01-01 00:00:07    419
2012-01-01 00:00:08     55
2012-01-01 00:00:09    104
2012-01-01 00:00:10    457
2012-01-01 00:00:11    249
2012-01-01 00:00:12    310
2012-01-01 00:00:13    346
2012-01-01 00:00:14    274
2012-01-01 00:00:15    459
2012-01-01 00:00:16    238
2012-01-01 00:00:17    404
2012-01-01 00:00:18    329
2012-01-01 00:00:19    167
2012-01-01 00:00:20    206
2012-01-01 00:00:21    252
2012-01-01 00:00:22    434
2012-01-01 00:00:23    270
2012-01-01 00:00:24    252
2012-01-01 00:00:25     78
2012-01-01 00:00:26    119
2012-01-01 00:00:27    128
2012-01-01 00:00:28    348
2012-01-01 00:00:29    283
                      ...
2012-01-01 00:01:10    218
2012-01-01 00:01:11    482
2012-01-01 00:01:12    429
2012-01-01 00:01:13     51
2012-01-01 00:01:14      1
2012-01-01 00:01:15    481
2012-01-01 00:01:16    372
2012-01-01 00:01:17    311
2012-01-01 00:01:18      6
2012-01-01 00:01:19    356
2012-01-01 00:01:20    467
2012-01-01 00:01:21    389
2012-01-01 00:01:22    115
2012-01-01 00:01:23    415
2012-01-01 00:01:24    496
2012-01-01 00:01:25    205
2012-01-01 00:01:26    332
2012-01-01 00:01:27    327
2012-01-01 00:01:28    367
2012-01-01 00:01:29    323
2012-01-01 00:01:30    350
2012-01-01 00:01:31     80
2012-01-01 00:01:32     97
2012-01-01 00:01:33     55
2012-01-01 00:01:34    153
2012-01-01 00:01:35    123
2012-01-01 00:01:36    268
2012-01-01 00:01:37    219
2012-01-01 00:01:38     87
2012-01-01 00:01:39     32
Freq: S, Length: 100, dtype: int32

In [149]:
ts.resample('5Min').sum()

2012-01-01    24909
Freq: 5T, dtype: int32

In [150]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [151]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [152]:
ts

2012-03-06   -0.705128
2012-03-07    0.149245
2012-03-08   -2.263359
2012-03-09    0.384086
2012-03-10    2.245475
Freq: D, dtype: float64

In [153]:
ts_utc = ts.tz_localize('UTC')

In [154]:
ts_utc

2012-03-06 00:00:00+00:00   -0.705128
2012-03-07 00:00:00+00:00    0.149245
2012-03-08 00:00:00+00:00   -2.263359
2012-03-09 00:00:00+00:00    0.384086
2012-03-10 00:00:00+00:00    2.245475
Freq: D, dtype: float64